{
  "ConstitutionalLawI-2016": {
    "subject": "Semester 1",
    "title": "Constitutional Law I",
    "units": [
      {
        "heading": "Year: 2016",
        "content": [
          "Question Paper Code: L806",
          "Questions:",
          "1. Write short notes on the following: (Compulsory, 4x10 marks)",
          "    (i) Annual Financial Statement",
          "    (ii) Appropriation Bill",
          "    (iii) Difference between Pardoning Power of President and Governor",
          "    (iv) Anti-Defection Law",
          "    (v) Doctrine of Political Question",
          "    (vi) 24th Constitution Amendment",
          "    (vii) Financial Emergency",
          "    (viii) Special leave to appeal",
          "    (ix) Contractual Liability of State",
          "    (x) Joint Sitting of Parliament",
          "2. Do you agree with the view that \"rule of law is the basic structure of the Constitution of India\"? What are the main features of rule of law? (UnitI, 15 marks)",
          "3. Define Constitution and discuss the salient features of Indian Constitution. (UnitI, 15 marks)",
          "4. Explain the distribution of legislative power between Centre and State. Discuss the circumstances in which Parliament may make the law on State list. (UnitII, 15 marks)",
          "5. Write short notes on the following: (UnitII, 15 marks)",
          "    (i) Doctrine of Territorial Nexus",
          "    (ii) Colourable Legislation",
          "6. What do you mean by Parliamentary Privilege? With the help of relevant cases discuss the relation between parliamentary privilege and fundamental right. (UnitIII, 15 marks)",
          "7. Discuss in detail the jurisdiction of Supreme Court. (UnitIII, 15 marks)",
          "8. What do you understand by Proclamation of Emergency? Discuss the effect of National Emergency. (UnitIV, 15 marks)",
          "9. Can fundamental right be amended? Discuss in the light of Basic Structure Theory. (UnitIV, 15 marks)"
        ]
      },
      {
        "heading": "Year: 2017",
        "content": [
          "Question Paper Code: 2618",
          "LL.B. Semester: Semester I",
          "Course Type: New Course",
          "Subject Name: Constitutional Law I (Sixth Paper)",
          "Duration of the Exam: 3 Hours",
          "Maximum Marks: 100",
          "Units of the Question Paper: UnitI, UnitII, UnitIII, UnitIV",
          "Instructions for Answering: Answer five questions in all. Question No. 1 is compulsory and attempt one question from each unit.",
          "Questions:",
          "1. Write short notes on the following: (Compulsory, 4x10=40 marks)",
          "    (a) Rule of Law",
          "    (b) Doctrine of pith and substance",
          "    (c) Protem speaker",
          "    (d) Original jurisdiction of Supreme Court",
          "    (e) Art. 142 of the Constitution",
          "    (f) Doctrine of political question",
          "    (g) Composition of Lok Sabha",
          "    (h) Effect of emergency on fundamental rights",
          "    (i) Shankari Prasad v. Union of India",
          "    (j) Discretionary powers of President",
          "2. What do you mean by Federal Constitution? In the light of Federal character, discuss the nature of Indian Constitution. (UnitI, 15 marks)",
          "3. Define Constitution and discuss the sources of Indian Constitution. (UnitI, 15 marks)",
          "4. Discuss the circumstances in which Parliament may make the law on state list given in the seventh schedule. (UnitII, 15 marks)",
          "5. What do you mean by legislative competence? Discuss the doctrines which help the court to determine the legislative competence. (UnitII, 15 marks)",
          "6. What do you mean by legislative process? How this process is different in case of ordinary bill and money bill? (UnitIII, 15 marks)",
          "7. With the help of decided cases discuss the procedure for the appointment of the judges of Supreme Court. (UnitIII, 15 marks)",
          "8. Discuss the provisions related to the President's rule. Is it subject to judicial review? Examine in the light of decided cases. (UnitIV, 15 marks)",
          "9. Discuss the tortious liability of State. (UnitIV, 15 marks)"
        ]
      },
      {
        "hedding": "Year: 2016",
        "content": [
          "Question Paper Code: LH1/2803",
          "Questions:",
          "1. Explain briefly the following:",
          "    Black Money",
          "    Positive and Normative Economics",
          "    Budget Line",
          "    Cross Elasticity of Demand",
          "    Long Run Average Cost Curve",
          "    Average Revenue and Marginal Revenue in an Imperfect Competitive Market",
          "    Dumping",
          "    Essential Conditions for Price Discrimination",
          "    Risk Theory of Profit",
          "    Scarcity Rent",
          "2. Explain in detail the concept of micro and macro economics. Discuss their scope and limitations.",
          "3. Discuss the Law of Variable Proportions in detail.",
          "4. Explain the concept of Elasticity of Demand. Discuss various methods to measure it.",
          "5. Discuss the main characteristics of Indifference Curves.",
          "6. “In the long run, every firm operates at minimum average cost, and this cost is equal to the price.” Discuss.",
          "7. Explain in detail the nature of marginal and average revenue in perfect competition and monopoly.",
          "8. “Interest is the reward for parting with liquidity and is decided by the demand and supply of money.” Critically evaluate.",
          "9. “Rent is the payment for the use of the original and indestructible powers of the soil.” Discuss."
        ]
      }
      
    ]
  },
  "EconomicsI": {
    "subject": "Economics I",
    "title": "Economics I",
    "units": [
      {
        "heading": "Year: 2016",
        "content": [
          "/* ... */ "
        ]
      },
      {
        "heading": "Year: 2017 (Paper 1)",
        "content": [
          "/* ... */"
        ]
      },
      {
        "heading": "Year: 2017 (Paper 2)",
        "content": [
          "/* ... */"
        ]
      },
      {
        "heading": "Year: 2022",
        "content": [
          "/* ... */"
        ]
      }
    ]
  }
}