{
  
    "ConstitutionalLawI-2016": {
      "subject": "Semester 1",
      "title": "Constitutional Law I",
      "units": [
        {
          "heading": "Year: 2016",
          "content": [
            "Question Paper Code: L806",
            "Questions:",
            "1. Write short notes on the following: (Compulsory, 4x10 marks)",
            "    (i) Annual Financial Statement",
            "    (ii) Appropriation Bill",
            "    (iii) Difference between Pardoning Power of President and Governor",
            "    (iv) Anti-Defection Law",
            "    (v) Doctrine of Political Question",
            "    (vi) 24th Constitution Amendment",
            "    (vii) Financial Emergency",
            "    (viii) Special leave to appeal",
            "    (ix) Contractual Liability of State",
            "    (x) Joint Sitting of Parliament",
            "2. Do you agree with the view that \"rule of law is the basic structure of the Constitution of India\"? What are the main features of rule of law? (UnitI, 15 marks)",
            "3. Define Constitution and discuss the salient features of Indian Constitution. (UnitI, 15 marks)",
            "4. Explain the distribution of legislative power between Centre and State. Discuss the circumstances in which Parliament may make the law on State list. (UnitII, 15 marks)",
            "5. Write short notes on the following: (UnitII, 15 marks)",
            "    (i) Doctrine of Territorial Nexus",
            "    (ii) Colourable Legislation",
            "6. What do you mean by Parliamentary Privilege? With the help of relevant cases discuss the relation between parliamentary privilege and fundamental right. (UnitIII, 15 marks)",
            "7. Discuss in detail the jurisdiction of Supreme Court. (UnitIII, 15 marks)",
            "8. What do you understand by Proclamation of Emergency? Discuss the effect of National Emergency. (UnitIV, 15 marks)",
            "9. Can fundamental right be amended? Discuss in the light of Basic Structure Theory. (UnitIV, 15 marks)"
          ]
        },
        {
          "heading": "Year: 2017",
          "content": [
            "Question Paper Code: 2618",
            "LL.B. Semester: Semester I",
            "Course Type: New Course",
            "Subject Name: Constitutional Law I (Sixth Paper)",
            "Duration of the Exam: 3 Hours",
            "Maximum Marks: 100",
            "Units of the Question Paper: UnitI, UnitII, UnitIII, UnitIV",
            "Instructions for Answering: Answer five questions in all. Question No. 1 is compulsory and attempt one question from each unit.",
            "Questions:",
            "1. Write short notes on the following: (Compulsory, 4x10=40 marks)",
            "    (a) Rule of Law",
            "    (b) Doctrine of pith and substance",
            "    (c) Protem speaker",
            "    (d) Original jurisdiction of Supreme Court",
            "    (e) Art. 142 of the Constitution",
            "    (f) Doctrine of political question",
            "    (g) Composition of Lok Sabha",
            "    (h) Effect of emergency on fundamental rights",
            "    (i) Shankari Prasad v. Union of India",
            "    (j) Discretionary powers of President",
            "2. What do you mean by Federal Constitution? In the light of Federal character, discuss the nature of Indian Constitution. (UnitI, 15 marks)",
            "3. Define Constitution and discuss the sources of Indian Constitution. (UnitI, 15 marks)",
            "4. Discuss the circumstances in which Parliament may make the law on state list given in the seventh schedule. (UnitII, 15 marks)",
            "5. What do you mean by legislative competence? Discuss the doctrines which help the court to determine the legislative competence. (UnitII, 15 marks)",
            "6. What do you mean by legislative process? How this process is different in case of ordinary bill and money bill? (UnitIII, 15 marks)",
            "7. With the help of decided cases discuss the procedure for the appointment of the judges of Supreme Court. (UnitIII, 15 marks)",
            "8. Discuss the provisions related to the President's rule. Is it subject to judicial review? Examine in the light of decided cases. (UnitIV, 15 marks)",
            "9. Discuss the tortious liability of State. (UnitIV, 15 marks)"
          ]
        }
      ]
    }
  




    "EconomicsI": {
      "subject": "Economics I",
      "title": "Economics I",
      "units": [
        {
          "heading": "Year: 2016",
          "content": [
            "Question Paper Code: LH1/2803",
            "Questions:",
            "1. Explain briefly the following:",
            "    Black Money",
            "    Positive and Normative Economics",
            "    Budget Line",
            "    Cross Elasticity of Demand",
            "    Long Run Average Cost Curve",
            "    Average Revenue and Marginal Revenue in an Imperfect Competitive Market",
            "    Dumping",
            "    Essential Conditions for Price Discrimination",
            "    Risk Theory of Profit",
            "    Scarcity Rent",
            "2. Explain in detail the concept of micro and macro economics. Discuss their scope and limitations.",
            "3. Discuss the Law of Variable Proportions in detail.",
            "4. Explain the concept of Elasticity of Demand. Discuss various methods to measure it.",
            "5. Discuss the main characteristics of Indifference Curves.",
            "6. “In the long run, every firm operates at minimum average cost, and this cost is equal to the price.” Discuss.",
            "7. Explain in detail the nature of marginal and average revenue in perfect competition and monopoly.",
            "8. “Interest is the reward for parting with liquidity and is decided by the demand and supply of money.” Critically evaluate.",
            "9. “Rent is the payment for the use of the original and indestructible powers of the soil.” Discuss."
          ]
        },
        {
          "heading": "Year: 2017 (Paper 1)",
          "content": [
            "Question Paper Code: 2571",
            "Questions:",
            "1. Explain briefly the following:",
            "    Macro Economics",
            "    Equilibrium",
            "    Income Elasticity of Demand",
            "    Consumer’s Surplus",
            "    Law of Diminishing Marginal Utility",
            "    L-shaped Long Run Average Cost Curve",
            "    Essential Conditions of Perfect Competition",
            "    Quasi Rent",
            "    Standard of Living Theory of Wages",
            "    Liquidity Trap",
            "2. Explain in detail the definition of economics given by Marshall and Robbins. Which according to you is better and why?",
            "3. Explain the following:",
            "    Positive and Normative Economics",
            "    Marginal Utility and Total Utility",
            "4. Discuss the Law of Demand. Why does the demand curve slope downward to the right?",
            "5. What are Indifference Curves? Discuss their main characteristics.",
            "6. What do you understand about Monopoly? How is price determined under conditions of monopoly?",
            "7. Explain the following:",
            "    CARTEL",
            "    Dumping",
            "8. Discuss Land Reforms in India.",
            "9. Critically evaluate modern theory of Rent."
          ]
        },
        {
          "heading": "Year: 2017 (Paper 2)",
          "content": [
            "Question Paper Code: 2608",
            "Questions:",
            "1. Explain briefly the following:",
            "    Opportunity Cost",
            "    Marginal Utility",
            "    Law of Demand",
            "    Price Elasticity",
            "    Law of Equi-Marginal Utility",
            "    Fixed and Variable Costs",
            "    Cartel",
            "    Average Revenue and Marginal Revenue",
            "    Ricardo’s Rent under Extensive Cultivation",
            "    Motives for Liquidity Preference",
            "2. How is Marshall’s definition of economics different from that of Robbins? Out of the two, which is better and why?",
            "3. Discuss with merits and demerits of Direct and Indirect Taxes.",
            "4. Define Indifference Curve. Explain Consumer’s Equilibrium with the help of Indifference Curve.",
            "5. Critically analyze the concept of Consumer Surplus.",
            "6. Explain the following:",
            "    Classification of Markets",
            "    As production increases, average fixed cost curve goes on falling whereas average variable cost curve takes a U curve, why?",
            "7. Explain conditions of perfect competition. Discuss a firm’s equilibrium under perfect competition.",
            "8. Explain the following:",
            "    Subsistence Theory of Wages",
            "    Wage Fund Theory",
            "9. Critically analyze the uncertainty-bearing theory of Profit."
          ]
        },
        {
          "heading": "Year: 2022",
          "content": [
            "Question Paper Code: 71012/2571",
            "Questions:",
            "1. India's phenomenal growth trajectory is an outcome of myriad of reforms, one such being goods and services tax. Discuss.",
            "2. Give a comparative analysis of the definition of Economics given by Marshall and Robbins.",
            "3. Define price elasticity of demand. What are the factors that influence the price elasticity of demand?",
            "4. What do you mean by Marginal rate of substitution? Explain consumer's equilibrium with the help of indifference curve technique.",
            "5. Discuss the shapes of total and average cost curves in the short run with the help of law of variable proportions.",
            "6. By bringing about differences between monopoly and perfect competition, list the assumptions of a perfectly competitive market. How is output determined under perfect competition in short run?",
            "7. Critically examine the liquidity preference theory of interest.",
            "8. \"Rent is a reward for specificity of a factor of production.\" In the light of above statement, explain the modern theory of rent.",
            "9. Discuss the various methods of measuring elasticity of demand.",
            "10. What is Dumping? Discuss its types and objectives. What are the anti-dumping measures available with government?"
          ]
        }
      ]
    }
  }


{
    "EnglishI-2016": {
      "subject": "Semester 1",
      "title": "English I / General English I",
      "units": [
        {
          "heading": "Year: 2016",
          "content": [
            "Question Paper Code: LH1/2807",
            "Questions:",
            "1. Attempt all parts:",
            "    Choose the correct forms of the verbs to fill in the blanks:",
            "        Help! I ___ fall. (will fall, am going to fall)",
            "        I shall not come if it ___ (rains, will rain)",
            "    Fill in the blanks with suitable prepositions:",
            "        He rules ___ a vast empire.",
            "        The driver jumped ___ the car.",
            "    Define 'question tag' or 'tag question' with example.",
            "    Use suitable articles:",
            "        ___ Mr. Roy whom you met is my uncle.",
            "        ___ Daniel come to judgement!",
            "    Turn the following into 'indirect speech':",
            "        A young Rajah once said to his Vizier, \"How is it that I am so often ill? I take great care of myself; I never go out in rain; I wear warm clothes; I eat good food. Yet I am always catching cold or getting fever.\"",
            "    What do you mean by the legal term 'Locus Standi'.",
            "    Explain the following idioms:",
            "        'At stake', 'At random', 'Blow hot and cold', 'Back out'",
            "    Correct the following sentences:",
            "        The man is mortal.",
            "        There was no any boy in class.",
            "    Write a letter to your friend congratulating him on success in the examination.",
            "    Use the following words in your own sentences:",
            "        Childish",
            "        Childlike",
            "        Access",
            "        Excess",
            "2. Transform the following sentences as directed in the brackets:",
            "    He declared that he was innocent. (Simple)",
            "    He died in his native village (Complex)",
            "    If you search his pockets, you will find the watch. (Compound)",
            "    One should keep one's promises. (Passive)",
            "    No other metal is as useful as iron. (Comparative)",
            "3. Change each of the sentences as directed in the brackets:",
            "    He was so tired that he could not stand. (Simple)",
            "    Who taught you grammar? (Passive)",
            "    Caesar was stabbed by Brutus. (Active)",
            "    Mumbai is one of the richest cities in India. (Comparative)",
            "4. Explain the following:",
            "    1. Amicus curie",
            "    2. Doli incapax",
            "    3. Ex Officis",
            "    4. Ex parte",
            "    5. Modus operandi",
            "    6. Pro bono-publico",
            "    7. Res nulls",
            "    8. Pendente lite",
            "    9. Status quo",
            "    10. Sub-Judice",
            "5. What do the following mean?",
            "    By and large",
            "    At sixes and sevens",
            "    A bed of roses",
            "    A bone of contention",
            "    A feather in the cap",
            "    Lame excuse",
            "    Maiden speech",
            "    Substitute one word for each:",
            "        Body of lawyers",
            "        The science of Plant",
            "        The manager of a museum",
            "        One who is engaged in legal battle",
            "        One who leads the way",
            "        A man who has lost his wife",
            "        A gathering of listeners",
            "6. Write a paragraph in about 100 words on any one of the following:",
            "    A rolling stone gathers no moss",
            "    The paths of glory lead but to the grave",
            "    It is better to travel hopefully than to arrive",
            "7. Write a letter to the editor of any newspaper highlighting the problem of corruption in public offices suggesting suitable measures.",
            "8. Translate the following passage into Hindi:",
            "    Similar to the central government, the executive, the legislature, and the judiciary have been created in the states also. The governor is the constitutional head of the state. According to Art. 153, each state shall have a governor. A person can also be appointed as governor for two or more states. They can hold office during the pleasure of the president. He can also resign from the office of the governor by addressing to the President. They hold office for five years. Even after completing their term, they can hold office till their successors do not occupy the post. The person, who is a citizen of India and has attained the age of 35 years, can be appointed as governor.",
            "9. Translate the following into English:",
            "    It is desirable that before the hearing of a case begins in a court, the court should clearly know what issue it has to decide. Similarly, it is desirable that the parties know what they are fighting for. The most satisfactory method to achieve this purpose is that before the hearing, each party states its case and responds to the opponent's case. Such statements and their responses are called 'pleadings'. In India, generally, there are only two pleadings in a suit: The statement of claim filed by the plaintiff, called the plaint, in which the plaintiff mentions all necessary details for his suit, and The defense or counterstatement submitted by the defendant, called the written statement, in which the defendant also mentions every material fact stated in the plaint that is in his favor."
          ]
        },
        {
          "heading": "Year: 2017",
          "content": [
            "Question Paper Code: 2612",
            "Questions:",
            "1. Attempt all parts:",
            "    a. Choose the correct forms of the verbs to fill in the blanks:",
            "        The plane ___ at 3.30 (arrives, will arrive)",
            "        Oh dear! I ___ (will sneeze, am going to sneeze)",
            "    b. Fill in the blanks with suitable prepositions:",
            "        What is the time ___ your watch?",
            "        The cat sprang ___ the table",
            "    c. Define 'question tag' or 'tag question' with example",
            "    d. Use suitable articles:",
            "        (i) He can play ___ flute",
            "        (ii) ___ pupil should obey his teacher",
            "    e. Turn the following into 'indirect speech':",
            "        'You say,' said the judge, 'that the bag you lost contained one hundred and ten pounds'; 'Yes, your honour,' replied the miser. 'Then as this one contains one hundred pounds it cannot be yours.'",
            "    f. What do you mean by the legal term 'Modus operandi'?",
            "    g. Explain the following idioms: 'A child's play', 'A black sheep', 'Bird of same feather', 'Head way'.",
            "    h. Correct the following sentences:",
            "        (i) He ran fastly.",
            "    Write a letter to your friend telling him how you spent your last summer vacation.",
            "    Use the following words in your own sentences:",
            "        Beside",
            "        Besides",
            "        Advice",
            "        Advise",
            "2. Transform the following sentences as directed in the brackets:",
            "    He confessed his crime. (Complex)",
            "    The fact that he is silent proves his guilt. (Simple)",
            "    He dictated me a letter. (Passive)",
            "    He was too tired to stand (Complex)",
            "3. Change each of the sentences as directed in the brackets:",
            "    I am certain you have made a mistake. (Compound)",
            "    The people will make him President (Passive)",
            "    My pocket has been picked (Active)",
            "    How beautiful is night! (Assertive)",
            "4. Explain the following:",
            "    Lex Fori",
            "    Locus standi",
            "    Malafide",
            "    Mens Rea",
            "    Quasijudicial",
            "    Sine die",
            "    Donatio mortis causa",
            "    Ab initio",
            "    Alibi",
            "    Caveat Emptor",
            "5. What do the following mean?",
            "    To catch red handed",
            "    To break the ice",
            "    Bag and baggage",
            "    Bread and butter",
            "    Back out",
            "    At random",
            "    At stake",
            "    To bell the cat",
            "    Substitute one word for each:",
            "        Body of lawyers",
            "        Science of Plants",
            "        An assembly of listeners",
            "        State of being unmarried",
            "        Science of Plants",
            "        A period of hundred years",
            "        A period of ten years",
            "6. Write a paragraph in about 100 words on any one of the following:",
            "    Time and Tide wait for none",
            "    Charity begins at home",
            "7. Write a letter to the editor of a newspaper highlighting the problem of corruption in public offices suggesting suitable measures.",
            "8. Translate the following passage into Hindi:",
            "    [No specific passage provided in the document]",
            "9. Translate the following into English:",
            "    Like the Centre, the form of administration in the states is parliamentary. The head of the executive is a constitutional head who has to act on the advice of the Council of Ministers. Under Article 153 of the Indian Constitution, provision has been made for the post of Governor, according to which every state shall have a Governor. The same Governor can be appointed for two or more states."
          ]
        },
        {
          "heading": "Year: 2022",
          "content": [
            "Question Paper Code: 71014",
            "Questions:",
            "1. Rewrite the following sentences as directed in the brackets:",
            "    Have you ever (do) it before? (Use the correct form of the verb given in bracket)",
            "    The students in this college play games regularly. (Rewrite in passive voice)",
            "    I was spoken to by the strange man in the park. (Rewrite in active voice)",
            "    He said, \"Manu, I want you to finish your homework in time.\" (Rewrite in indirect speech)",
            "    Those clothes are mine. (Add appropriate question tag)",
            "    They denied having a plan to humiliate him. (Transform into negative sentence)",
            "    You are forbidden not to touch my books. (Rewrite the sentence correctly)",
            "2. Rewrite the following sentences as directed in brackets:",
            "    The traveller was attacked ___ a dagger. (Supply suitable preposition)",
            "    ___ letter which I wrote you yesterday stands as a proof of my goodwill. (Use suitable article)",
            "    The servant was a thief. The mother found this. (Simple sentence)",
            "    She was very tired. She kept on working. (Make compound sentence)",
            "    The lady got the job. I recommended her. (Complex sentence)",
            "    Laugh and the world will laugh with you. (Complex sentence)",
            "    He gave me useful advice as well as financial help. (Make simple sentence)",
            "3. Give the meaning of the following legal terms:",
            "    Res integra",
            "    Corpus Delicti",
            "    Noncompos mentis",
            "    Ipso facto",
            "    Obiter Dictum",
            "    Caveat Emptor",
            "    Quid Pro Quo",
            "4. Explain the following legal terms:",
            "    Persona nongrata",
            "    Factum valet",
            "    Suo moto",
            "    Lex loci",
            "    Pendente lite",
            "    Parole",
            "    Culpable homicide",
            "5. Write short notes on the following:",
            "    Habeas Corpus",
            "    De facto and De Jure",
            "    Actus Dei Nemini Facit Injuriam",
            "    Ambiguitas patent and Ambiguitas latens",
            "6. Substitute one word for the following:",
            "    A member of the middle class.",
            "    One who abstains from alcohol",
            "    One who looks at the bright side of things",
            "    An office with high salary but no work",
            "    Explain the following idioms:",
            "        To cut a sorry figure",
            "        Beat about the bush",
            "        Left in the lurch",
            "7. Write a letter to the editor of a newspaper about the enormous increase in the prices of essential commodities.",
            "8. Draft a plaint for a suit for Defamation.",
            "9. Write an essay on any one of the following:",
            "    Bar and Bench Relations",
            "    Independence of Judiciary",
            "10. Translate the following passage into English:",
            "    [Passage in Hindi about the Indian Constitution, its similarity to the English Constitution, fundamental rights, equality, secularism, parliamentary amendments, elections, reserved seats, and cabinet governance.]",
            "    Translate the following terms into Hindi:",
            "        Habeas corpus",
            "        Accused",
            "        Custody",
            "        Document",
            "        Claimant",
            "        Mandamus"
          ]
        }
      ]
    }
  }




{
    "FamilyLawI": {
      "subject": "Family Law I",
      "title": "Family Law I",
      "units": [
        {
          "heading": "Year: 2016",
          "content": [
            "Question Paper Code: L804",
            "Questions:",
            "1. Write short notes on the following:",
            "    (i) Shruti as a source of Hindu Law",
            "    (ii) Essential conditions of a valid marriage under Hindu Law",
            "    (iii) Divorce by mutual consent under Hindu Law",
            "    (iv) Objects of adoption",
            "    (v) Testamentary guardian under Hindu Law",
            "    (vi) Qiyas as a source of law under Muslim Law",
            "    (vii) Difference between valid and irregular marriages under Muslim Law",
            "    (viii) Option of Puberty (KhayarulBalugh)",
            "    (ix) Iddat and rationale behind it",
            "    (x) Kinds of Dower",
            "2. What are the different sources of Hindu Law? Discuss Custom and legislation in detail.",
            "3. \"Hindu Marriage is a sacrament\". Whether it is true? Discuss in detail the nature of Hindu marriage.",
            "4. Discuss the changes brought about by Hindu Adoption and Maintenance Act, 1956 in Hindu Law. State, who may adopt a child under modern Hindu Law?",
            "5. Discuss the basic objects of guardianship and powers of testamentary guardian under Hindu Minority and Guardianship Act, 1956.",
            "6. \"Muslim marriage is monogamous in general and polygamy is an exception\". Discuss.",
            "7. Discuss the various forms of 'Divorce' under Muslim Law.",
            "8. What are the objects of Dower? What are its kinds? Explain.",
            "9. What do you understand by acknowledgement of paternity? Explain."
          ]
        },
        {
          "heading": "Year: 2017",
          "content": [
            "Question Paper Code: 2616",
            "Questions:",
            "1. Write short notes on the following:",
            "    (i) To whom does the Hindu law apply?",
            "    (ii) Objects of marriage",
            "    (iii) Sapinda",
            "    (iv) Maintenance pendente lite",
            "    (v) Object of adoption",
            "    (vi) Divorce by mutual consent under Hindu law",
            "    (vii) Irregular marriage",
            "    (viii) Option of puberty",
            "    (ix) Iddat",
            "    (x) Prompt Dower",
            "2. What are the essential conditions for a valid marriage under Hindu Marriage Act, 1955? Discuss in detail.",
            "3. Discuss the various grounds of divorce under Hindu Marriage Act, 1955 with special reference to cruelty.",
            "4. Discuss the circumstances under which a Hindu wife may live separately from her husband without forfeiting her right of maintenance.",
            "5. What are the essential conditions of a valid adoption under the Hindu Adoption and Maintenance Act, 1956? Discuss.",
            "6. Define Nikah. Is it a contract? Discuss at length.",
            "7. Explain the various sources of Muslim Law with special reference to Quran.",
            "8. Can a Muslim woman divorce her husband? If so, under what circumstances? Can husband and wife remarry after divorce?",
            "9. Discuss the salient features of Muslim Women (Protection of Rights on Divorce) Act, 1986."
          ]
        },
        {
          "heading": "Year: 2023",
          "content": [
            "Question Paper Code: 81014",
            "Questions:",
            "1. Explain the conditions of a valid Hindu Marriage under Hindu Marriage Act, 1955.",
            "2. With the help of decided case laws, point out the requisites to constitute desertion as a ground of divorce under Hindu Marriage Act, 1955.",
            "3. Mention the capacity and rights of a Hindu male and female to adopt a child under Hindu Adoption and Maintenance Act, 1956.",
            "4. What are the powers of a natural guardian under Sec. 8 of the Hindu Minority and Guardianship Act, 1956? Does these powers are absolute? Explain.",
            "5. Explain the term bar of consanguinity, bar of affinity, and fosterage relationship as essential conditions of Nikah under Muslim Law.",
            "6. Does Muslim Women has right to 'Talaaq'? If yes, explain its form and procedure.",
            "7. Discuss the rights and remedies of the Muslim wife on nonpayment of dower.",
            "8. A mother can be a legal guardian of the property of a minor under Muslim law? Explain concerned law.",
            "9. Explain the following:",
            "    (i) Nikah of Hindu/Marriage",
            "    (ii) Schools of Muslim Law",
            "10. Write short notes on the following:",
            "    (i) Ceremonies of Hindu Marriage",
            "    (ii) Iddat under Muslim Law"
          ]
        }
      ]
    }
  }



{
    "HistoryI": {
      "subject": "History I",
      "title": "History I",
      "units": [
        {
          "heading": "Year: 2016",
          "content": [
            "Question Paper Code: LH1/2801",
            "Questions:",
            "1. Write short notes on the following:",
            "    Definition of history",
            "    Kharoshthi script",
            "    Potassium-Argon (40K40Ar) dating method",
            "    Sabha",
            "    Administrative apparatus of Delhi Sultanate",
            "    Pravara",
            "    Main objectives of Aligarh movement",
            "    Sutras as a legal source",
            "    Witnesses",
            "    Some legal changes introduced by Akbar",
            "2. Describe the contributions of paleography and numismatics to rewrite the ancient Indian history.",
            "3. Discuss the relationship between history and law. How does history contribute to law for shaping the legislation?",
            "4. 'Mansabdari system was an extreme necessity for Mughal Army.' Critically examine the aforesaid statement.",
            "5. Elaborate the adopted various forms in Civil Disobedience Movement. Comment on its success.",
            "6. Discuss the Iqtadari System prevalent in Delhi Sultanate.",
            "7. Critically evaluate the market reforms of Allauddin Khalji.",
            "8. Discuss the following:",
            "    Courts of Guilds",
            "    Sharia and Hadith as sources of Islamic law",
            "9. What was the status of Chief Qazi in the Mughal period? State the contributions of Chief Qazi in Mughal judicial administration."
          ]
        },
        {
          "heading": "Year: 2017",
          "content": [
            "Question Paper Code: 2606",
            "Questions:",
            "1. Write short notes on the following:",
            "    Kingship",
            "    Gupta polity",
            "    Mansabdari system",
            "    Panchayat",
            "    Brihaspati",
            "    Investigation Process",
            "    Chola village",
            "    Samiti",
            "    Chief Qazi",
            "    Women education in ancient India",
            "2. Evaluate the utility of literary sources to rewrite the ancient Indian history.",
            "3. Do you agree that history gives directions to law? Discuss its relation with law.",
            "4. Do you agree that the non-cooperation movement was the first step towards swaraj? State the causes of its failure.",
            "5. Write short notes on the following:",
            "    Kautilya",
            "    Baiban",
            "6. What reformation had been made through the Aligarh movement?",
            "7. Discuss the social reformations of Raja Ram Mohan Roy.",
            "8. Discuss the salient features of Islamic Criminal Law.",
            "9. Write short notes on the following:",
            "    Witness",
            "    Manu"
          ]
        },
        {
          "heading": "Year: 2022",
          "content": [
            "Question Paper Code: 71013/2669",
            "Questions:",
            "1. Do you agree that 'History is mother of all subjects' and describe its relation with law?",
            "2. Evaluate the utility of literary sources to rewrite Indian History.",
            "3. Discuss the Mughal Mansabdari system.",
            "4. Discuss the social reforms of Raja Ram Mohan Roy.",
            "5. Do you agree that the Non-cooperation movement was the first step towards Swaraj? State the causes of its failure.",
            "6. Throw light on Mauryan Polity and Chola Village Administration.",
            "7. Social institutions in Ancient India: Ashram and Family.",
            "8. Describe the ancient period courts: Pratishthit, Apratishthit, and Mudrita.",
            "9. Write about the judicial organizations in Mughal period: King, Chief Qazi, and Judicial Officers.",
            "10. Write about the status of women in Ancient India: Education, Marriage, Legal Rights, Divorce, and Widows."
          ]
        }
      ]
    }
  }



{
    "JurisprudenceI": {
      "subject": "Semester 1",
      "title": "Jurisprudence I",
      "units": [
        {
          "heading": "Year: 2016",
          "content": [
            "Question Paper Code: L801",
            "Questions:",
            "1. Write short notes on the following: (Compulsory, 4x10 marks)",
            "    (i) Supreme and Subordinate Legislation",
            "    (ii) General and Particular Jurisprudence",
            "    (iii) Static society and progressive society",
            "    (iv) Difference between Judicial Precedent and Res judicata",
            "    (v) Difference between Analytical and Historical School",
            "    (vi) Secondary Rule",
            "    (vii) Status to Contract and Contract to Status",
            "    (viii) Capital punishment",
            "    (ix) Legal theory and Jurisprudence",
            "    (x) Compare American and Scandinavian Realists",
            "2. Define Jurisprudence. Discuss that Jurisprudence is the formal science of Positive Law. (UnitI, 15 marks)",
            "6. Explain the theory of Social Engineering. (UnitIII, 15 marks)",
            "7. What is Criminal Justice? Discuss the Reformative theory of Punishment. (UnitIII, 15 marks)",
            "8. Define Custom. What are the essential elements of Valid Customs? (UnitIV, 15 marks)",
            "9. Write short notes on the following: (UnitIV, 15 marks)",
            "    (i) Declaratory theory",
            "    (ii) Authoritative Precedent"
          ]
        },
        {
          "heading": "Year: 2017",
          "content": [
            "Question Paper Code: 2613",
            "Questions:",
            "1. Write short notes on each of the following: (Compulsory, 4x10=40 marks)",
            "    (a) Law is what judges say",
            "    (b) Politically organised society under Analytical school",
            "    (c) Law is child of history",
            "    (d) When does custom become law?",
            "    (e) Doctrine of Precedent in England",
            "    (f) Importance of sociological school of law",
            "    (g) Difference among law, a law and the law",
            "    (h) Criticism of deterrent theory of punishment",
            "    (i) General and particular Jurisprudence",
            "    (j) Difference between Analytical and Historical school of law",
            "2. What do you mean by Jurisprudence? Discuss its nature and scope. (UnitI, 15 marks)",
            "3. “Jurisprudence is the science of civil law.” Discuss. (UnitI, 15 marks)",
            "4. Discuss the reasons for the development of Historical school of law. What are the stages of development of law discussed by Sir Henry Maine? (UnitII, 15 marks)",
            "5. Discuss the Realist school of law. (UnitII, 15 marks)",
            "6. What do you mean by social engineering of Roscoe Pound? Discuss different kinds of interest in society discussed by Roscoe Pound. (UnitIII, 15 marks)",
            "7. What do you mean by administration of justice? Discuss different theories of punishment. (UnitIII, 15 marks)",
            "8. Define legislation and discuss different kinds of legislation as a source of law. (UnitIV, 15 marks)",
            "9. What do you mean by precedent as a source of law? Is there any difference between Ratio decidendi and obiter dicta? (UnitIV, 15 marks)"
          ]
        },
        {
          "heading": "Year: 2023",
          "content": [
            "Question Paper Code: 81011",
            "Questions:",
            "1. What do you understand by sources of law? Discuss precedent as source of law. (UnitI, 15 marks)",
            "2. Define jurisprudence and discuss its nature and scope. (UnitI, 15 marks)",
            "3. How far do you agree that the movement of progressive societies is now from contract to status? Examine in the light of welfare state concept. (UnitI, 15 marks)",
            "4. What do you mean by Natural law? How far this ideology is different from analytical and historical ideology? (UnitII, 15 marks)",
            "5. Define ownership and discuss the various kinds of ownership. (UnitII, 15 marks)",
            "6. What do you understand by legal person? Discuss the legal status of unborn child and Gurugranth Sahib. (UnitIII, 15 marks)",
            "7. Discuss the Aristotle's theory of justice. How is it different from Utilitarian theory of justice? (UnitIII, 15 marks)",
            "8. What do you understand by Modernism and postmodernism? Discuss in detail. (UnitIV, 15 marks)",
            "9. Discuss the Pound's theory of social engineering. (UnitIV, 15 marks)",
            "10. \"Law is the synthesis of primary and secondary rule.\" Explain. (UnitIV, 15 marks)"
          ]
        }
      ]
    }
  }


{
    "LanguageAndWriting-2017": {
      "subject": "Language and Writing",
      "title": "Language and Writing - 2017",
      "units": [
        {
          "heading": "Year: 2017",
          "content": [
            "Question Paper Code: 2574",
            "Questions:",
            "1. Attempt all parts:",
            "    (a) Describe qualities of a good precis.",
            "    (b) What elements must appear in the structure of every report?",
            "    (c) What do you understand by the 'Semantic gap'?",
            "    (d) What are the barriers to Communication?",
            "    (e) Explain the following legal maxims:",
            "        (i) Alibi",
            "        (ii) Subjudice",
            "        (iii) Status quo",
            "    (f) Write a short note on 'Bar-Bench Relations'.",
            "    (g) Write a note on 'PIL'.",
            "    (h) 'Falder is the victim of circumstances', comment.",
            "    (i) Comment on the importance of 'Moot Court' in legal education.",
            "    (j) Discuss the theme of love in 'Arms and the Man'.",
            "2. Read the following passage and answer the questions given below: (Passage about a writ petition under Article 32 for habeas corpus)",
            "    (a) What is meant by habeas corpus?",
            "    (b) What do you mean by arbitrariness?",
            "    (c) Whether it was essential to provide legal assistance to the detenu under the act of 1980?",
            "    (d) How the procedure of the Advisory Board was arbitrary and unreasonable?",
            "3. Draft a precis of the passage given in Q No. 2 and also suggest a suitable title to the passage.",
            "4. 'Communication is a complex interactive process, involving shared assumptions and unspoken agreements between individuals.' Discuss.",
            "5. Explain the following legal maxims:",
            "    (a) Mala fide",
            "    (b) Mens Rea",
            "    (c) Nexus",
            "    (d) Locus Standi",
            "    (e) Pendente lite",
            "    (f) Prima facie",
            "    (g) Protem",
            "    (h) Quasi-judicial",
            "    (i) Doli incapax",
            "    (j) Exparte",
            "6. Discuss the particulars that the plaintiff must state in his plaint.",
            "7. Draft an application for the Restoration of suit dismissed in default.",
            "8. Write a brief summary of the play 'Justice' written by John Galsworthy.",
            "9. Describe the main theme of the play 'Arms and the Man' written by Bernard Shaw."
          ]
        }
      ]
    }
  }


{
    "LawOfContractI": {
      "subject": "Law of Contract I",
      "title": "Law of Contract I",
      "units": [
        {
          "heading": "Year: 2016",
          "content": [
            "Question Paper Code: L802",
            "Questions:",
            "1. Write short notes on the following:",
            "    General offer and specific offer",
            "    Essentials for valid acceptance",
            "    Definition of consideration",
            "    Definition of fraud with its essential elements",
            "    Difference between void & voidable agreements",
            "    Difference between contingent contract and wagering agreement",
            "    Subsequent impossibility",
            "    Remoteness of damages",
            "    Reciprocal promises",
            "    Agreement in restraint of legal proceedings",
            "2. \"All contracts are said to be an agreement, but all agreements are not said to be contracts.\" In the light of the above statement, define with valid elements for a contract.",
            "3. When is an offer said to be communicated and when is it said to be revoked?",
            "4. What is the nature of a minor’s contract? Up to what extent is he liable? Discuss with the help of decided case laws.",
            "5. \"A contract is a private relationship between the parties who make it and no other person can acquire rights or incur liability under it.\" Explain the above statement with case laws.",
            "6. \"Legality of an object is a very wide term; it includes morality and public policy.\" Explain in the light of the above statement the legality of object in a contract.",
            "7. Explain the concept of frustration in the matter of contract. Up to what extent is this doctrine of frustration applicable in mercantile transactions?",
            "8. There is no offer, no acceptance, but a contract sticks with you for the fulfillment of certain legal obligations. Do you agree with this above statement? Explain it.",
            "9. Discuss the principles according to which the damages for breach of contract are assessed."
          ]
        },
        {
          "heading": "Year: 2017 (Paper 1)",
          "content": [
            "Question Paper Code: 2576",
            "Questions:",
            "1. Write short notes on the following:",
            "    Adequacy of consideration",
            "    General Offer",
            "    Revocation of offer",
            "    Definition of Consent",
            "    Acceptance by telephone",
            "    Void and voidable contract",
            "    Difference between Fraud and Misrepresentation",
            "    Anticipatory breach of Contract",
            "    Injunction",
            "    Damages and compensation",
            "2. Define an offer. What are its essentials? Differentiate it with invitation to offer.",
            "3. Define the term 'Acceptance'. Discuss its essentials also.",
            "4. What do you understand by capacity to contract? Discuss the law relating to competence of the parties.",
            "5. What do you understand by the term 'Consideration'? Explain the circumstances under which a contract without consideration is valid.",
            "6. \"Every agreement of which the object or consideration is unlawful, is void.\" Discuss.",
            "7. What do you understand by a wagering agreement? What are its essentials? Differentiate it with contingent contract.",
            "8. What do you understand by Quasi Contracts? Discuss.",
            "9. Discuss the remedies available to an aggrieved party for breach of contract."
          ]
        },
        {
          "heading": "Year: 2017 (Paper 2)",
          "content": [
            "Question Paper Code: 2614",
            "Questions:",
            "1. Write short notes on the following:",
            "    Counter offer",
            "    Acceptance by post",
            "    Essentials of valid contract",
            "    Definition of consent",
            "    Difference between coercion and undue influence",
            "    Anticipatory breach of contract",
            "    Meaning of contingent contract",
            "    Special damage",
            "    Essentials of wagering agreement",
            "    Distinction between liquidated damages and penalty",
            "2. What do you understand by general offer? What is the difference between offer and invitation to offer? Explain.",
            "3. \"The acceptance of an offer to be effective must fulfil certain conditions.\" Explain this statement enumerating those conditions.",
            "4. Define consideration. \"All agreements without consideration are void\". If there is any exception to this rule, give them.",
            "5. What do you know about capacity to contract? Who are the various persons declared as incompetent by law to enter into contract? Discuss.",
            "6. What is the doctrine of subsequent or supervening impossibility? What are its effects and in what cases is this doctrine not applicable?",
            "7. \"Every agreement of which the object or consideration is unlawful, is void.\" Explain and state the cases in which the object and consideration is unlawful.",
            "8. Discuss the provisions of the Indian Contract Act relating to quasi contract. What is the difference between quasi contract and a contract?",
            "9. What do you understand by the doctrine of \"Quantum Meruit\"? State the cases in which a claim for quantum meruit arises."
          ]
        },
        {
          "heading": "Year: 2022",
          "content": [
            "Question Paper Code: 71016",
            "Questions:",
            "1. \"An agreement enforceable by law is contract\". Comment with the help of relevant illustrations.",
            "2. Offer must be communicated to the persons, to whom it is made. Discuss with the help of decided case laws.",
            "3. Describe the essentials of valid acceptance with the help of case laws.",
            "4. Define 'consideration'. What are the requirements to satisfy the valid consideration? Describe with the help of decided case laws.",
            "5. \"The rule that stranger to contract can't sue\". Discuss Indian legal position with the help of decided case laws.",
            "6. Consent is a state of mind. What are the provisions relating to free consent under Indian Contract Act, 1872?",
            "7. By whom should the contract be performed, also discuss provisions relating to time and place.",
            "8. Discuss the consequences when performance of the contract becomes impossible, with the help of decided case laws and relevant provisions of Indian Contract Act, 1872.",
            "9. Examine critically the rule in Hadley Vs. Baxendale and indicate to what extent the said rule is applicable in India?",
            "10. Explain the cases in which the claim on quantum meruit basis arises."
          ]
        }
      ]
    }
  }



{
    "LawOfCrimesI-2016-2017": {
      "subject": "Law of Crimes I",
      "title": "Indian Penal Code",
      "units": [
        {
          "heading": "Year: 2016",
          "content": [
            "Question Paper Code: L805",
            "Questions:",
            "1. Write short notes on the following: (Compulsory, 4x10 marks)",
            "    (i) Intention and motive",
            "    (ii) Extraterritorial jurisdiction of Indian Penal Code",
            "    (iii) Mistake of Law as defence",
            "    (iv) Inevitable Accident",
            "    (v) Preparing to wage war against state",
            "    (vi) Nature of punishment for children",
            "    (vii) Abetting to a child for committing an offence",
            "    (viii) Law given in R Vs Prince",
            "    (ix) Common intention",
            "    (x) Common object",
            "2. Define mens rea. Discuss the role of mens rea in imposition of criminal liability upon a person. Explain it with Special reference to the Case R Vs Tolson. (15 marks)",
            "3. Define crime. What is the attempt stage of committing a crime? Distinguish between preparation and attempt stage of crime. (15 marks)",
            "4. What is the law of defence on insanity? Discuss with special reference to Mc Naughton Rules. Support your answer with case laws. (15 marks)",
            "5. What is right of private defence? What are restrictions provided under laws under which the private defence cannot be claimed? Discuss with reasons. (15 marks)",
            "6. Define abetment. Discuss in detail the concept of criminal liability for abetment. A abets B to commit an offence, but B refuses to do so. Discuss the legal position. (15 marks)",
            "7. What is criminal conspiracy? Discuss with the help of statutory provisions. Distinguish between abetment and conspiracy. (15 marks)",
            "8. What is punishment? Discuss the related provision under IPC. \"Punishment is not an end but it is a means to an end\". Explain. (15 marks)",
            "9. What do you understand by theories of punishment? Which theory of punishment do you like most? Give reasons. (15 marks)"
          ]
        },
        {
          "heading": "Year: 2017",
          "content": [
            "Question Paper Code: 2617",
            "Questions:",
            "1. Write short notes/answers on the following: (Compulsory, 4x10=40 marks)",
            "    (i) Explain Section 34 of IPC briefly.",
            "    (ii) Define ‘Good Faith’ under I.P.C.",
            "    (iii) Define ‘reason to believe’ and ‘dishonestly’ under the Indian Penal Code.",
            "    (iv) Write a brief note on theories of punishment.",
            "    (v) Difference between legal and medical insanity.",
            "    (vi) Accident as a defence under Indian Penal Code.",
            "    (vii) Mistake of fact and mistake of law.",
            "    (viii) Extent and extraterritorial jurisdiction of Indian Penal Code.",
            "    (ix) Write a brief note on Section 81 of I.P.C.",
            "    (x) Limitations of the right of private defence.",
            "2. Discuss in detail the essential elements of a crime. (15 marks)",
            "3. Explain ‘Attempt’ in detail with the help of cases. (15 marks)",
            "4. What is the law of defence on intoxication? Discuss the law laid down in Basudeo vs. State of Pepsu. (15 marks)",
            "5. When does the right of private defence of the body extend to causing the death of the assailant? Explain. (15 marks)",
            "6. Define abetment and discuss various modes of it in detail. (15 marks)",
            "7. Discuss criminal conspiracy in detail. (15 marks)",
            "8. Critically examine the relevancy of capital punishment. (15 marks)",
            "9. Explain the kinds of punishment and also discuss solitary confinement under the Indian Penal Code. (15 marks)"
          ]
        }
      ]
    }
  }




{
    "LawOfTortsI-2016": {
      "subject": "Semester 1",
      "title": "Law of Torts I",
      "units": [
        {
          "heading": "Year: 2016",
          "content": [
            "Question Paper Code: L803",
            "Questions:",
            "1. Write short notes on the following:",
            "    (i) Tort against minor",
            "    (ii) Malice in Tort",
            "    (iii) Libel",
            "    (iv) Last opportunity rule",
            "    (v) Public Nuisance",
            "    (vi) Damage and damages",
            "    (vii) Law of Tort or Law of Torts",
            "    (viii) Pigeonhole theory",
            "    (ix) 'Every civil wrong is not tort'",
            "    (x) Distinguish between assault and battery",
            "2. \"Injury with or without damage is actionable in Law of Tort but damage without injury is not actionable\". Explain. (15 marks)",
            "3. \"Tort is a civil wrong different with crime and breach of contract\". Explain. (15 marks)",
            "4. Explain the maxim 'Injuria sine damnum' with the help of decided cases. (15 marks)",
            "5. Discuss in the light of decided cases the law relating to nervous shock. (15 marks)",
            "6. Explain the maxim 'Volenti non fit injuria'. Give its exceptions with the help of cases. (15 marks)",
            "7. When excess force than required is used, right of private defence is not available. Explain. (15 marks)",
            "8. Define 'joint tort feasors' in the light of decided cases. Discuss the liability of tort feasor against child in womb. (15 marks)",
            "9. \"A plaintiff will succeed only if his injury is a proximate cause of the defendant’s conduct.\" Discuss. (15 marks)"
          ]
        },
        {
          "heading": "Year: 2017 (Paper 1)",
          "content": [
            "Question Paper Code: 2575",
            "Questions:",
            "1. Write short notes on the following:",
            "    (i) Pigeonhole theory",
            "    (ii) Mention essential elements of tort",
            "    (iii) Explain the maxim 'Injuria sine damnum' with the help of decided cases",
            "    (iv) Malice in tort",
            "    (v) Difference between assault and battery",
            "    (vi) Write essential elements of 'volenti non fit injuria'. Mention any two exceptions",
            "    (vii) Write difference between Act of God and inevitable accident",
            "    (viii) Who is a 'consumer' under Consumer Protection Act, 1986?",
            "    (ix) Explain private defence under tort",
            "    (x) Damage and dangers",
            "2. Discuss the difference between tort and crime, tort and contract, and tort and quasi-contract. (15 marks)",
            "3. What are the defences available under tort? Discuss at least four of them in detail. (15 marks)",
            "4. What do you understand by Nuisance? What is the difference between private nuisance and public nuisance? Support your answer with cases and provisions under different statutes. (15 marks)",
            "5. Discuss the elements of negligence in detail and support it with relevant cases. (15 marks)",
            "6. Discuss the elements of defamation in detail. What are the defences available? Support your answer with cases. (15 marks)",
            "7. Discuss the concept of vicarious liability in detail. (15 marks)",
            "8. What are the rights and duties of a consumer under Consumer Protection Act, 1986? (15 marks)",
            "9. Discuss about the redressal forums available under Consumer Protection Act, 1986. (15 marks)"
          ]
        },
        {
          "heading": "Year: 2017 (Paper 2)",
          "content": [
            "Question Paper Code: 2615",
            "Questions:",
            "1. Write short note on the following:",
            "    (i) Libel",
            "    (ii) Public Nuisance",
            "    (iii) Hacking",
            "    (iv) Is fault necessary for a Tort?",
            "    (v) Quasi-Parental authority",
            "    (vi) Respondent Superior",
            "    (vii) Contributory Negligence",
            "    (viii) Vis-major",
            "    (ix) Tort by lunatic",
            "    (x) Battery",
            "2. Define Tort. How tort is different from crime and breach of contract? Explain. (15 marks)",
            "3. \"Tortious liability arises from breach of a duty primarily fixed by law.\" Is it redressible by unliquidated damages? (15 marks)",
            "4. Explain the meaning of \"ubi jus ibi remedium\". Refer leading cases. (15 marks)",
            "5. \"Injury with or without damage is actionable in law of tort\". Explain. (15 marks)",
            "6. In the light of the principle of vicarious liability discuss the act of master for the tort of independent contractor. (15 marks)",
            "7. Whether rescue cases are exceptions of volenti non fit injuria? Why, explain. (15 marks)",
            "8. What are the tests to determine the remoteness of damages? A person is held responsible in law only for direct consequences. Explain. (15 marks)",
            "9. In case of lending of servant, there become two masters. Explain with the help of cases. (15 marks)"
          ]
        }
      ]
    }
  }

{
    "LegalAndConstitutionalHistory-2017": {
      "subject": "Legal and Constitutional History",
      "title": "Legal and Constitutional History - 2017",
      "units": [
        {
          "heading": "Year: 2017",
          "content": [
            "Question Paper Code: 2573",
            "Questions:",
            "1. Write short notes on the following: (Compulsory, 4x10 marks)",
            "    (i) Mudrit Court",
            "    (ii) Yajnavalkya",
            "    (iii) Quran as an Islamic source of law",
            "    (iv) The provisions of the Charter of 1600 A.D.",
            "    (v) Provisions of Pitts India Act",
            "    (vi) Judicial Plan of Lord Cornwallis of 1790 A.D.",
            "    (vii) Lex Loci Report",
            "    (viii) Qualifications to be the Chief Justice and Justices of Federal Court",
            "    (ix) Central Legislature under the Government of India Act, 1935",
            "    (x) Main provisions of the India Council Act, 1861",
            "2. Discuss the composition, powers and judicial functions of court of Guilds and Kantakshodhan court. (15 marks)",
            "3. Elaborate the salient features of Islamic Criminal laws. (15 marks)",
            "4. State the facts in issue of the case of Raja Nand Kumar. Critically evaluate the decision of this case. (15 marks)",
            "5. Discuss the main provisions of the Charter of 1726. (15 marks)",
            "6. Equity, Justice and good conscience were the measures of adjudication and how it helped to develop the civil laws in the Mofussil courts. Discuss. (15 marks)",
            "7. Discuss the following: (15 marks)",
            "    (i) Origin and development of Privy Council",
            "    (ii) Modification and Quorum of Privy Council",
            "    (iii) Appellate Jurisdiction",
            "    (iv) Rules of appeal",
            "8. Discuss the main provisions of the Indian Independence Act, 1947. (15 marks)",
            "9. Was Quit India Movement the extreme attempt to obtain the self rule? Examine its success. (15 marks)"
          ]
        }
      ]
    },
    "NationalMovementsAndIndianConstitution-2016": {
      "subject": "National Movements and Indian Constitution",
      "title": "National Movements and Indian Constitution - 2016",
      "units": [
        {
          "heading": "Year: 2016",
          "content": [
            "Question Paper Code: 2806",
            "Questions:",
            "1. Write short notes on the following: (Compulsory, 4x10 marks)",
            "    (i) Indian Independence Act, 1947",
            "    (ii) Mahatma Gandhi and National Movement",
            "    (iii) Position of Governor",
            "    (iv) Fundamental duties",
            "    (v) Round Table Conference",
            "    (vi) Composition of Municipalities",
            "    (vii) Constituent Assembly",
            "    (viii) Unicameral and Bicameral",
            "    (ix) ChauriChaura incident",
            "    (x) Right to Constitutional remedies",
            "2. Discuss the social, religious and military causes of first independence struggle of 1857. (15 marks)",
            "3. Write short notes on the following: (15 marks)",
            "    (i) Difference between Moderates and Extremist",
            "    (ii) Home Rule League Movement",
            "4. Describe the Legislative relation between the Centre and States. (15 marks)",
            "5. Discuss the freedom of speech and expression. (15 marks)",
            "6. How the Ordinary Bill is passed in the Parliament? (15 marks)",
            "7. Discuss the relation of Lok Sabha and Rajya Sabha. (15 marks)",
            "8. Describe the functions and powers of Election Commission. (15 marks)",
            "9. Write short notes on the following: (15 marks)",
            "    (i) Special Constitutional provisions for backward classes",
            "    (ii) Functions of Planning Commission"
          ]
        },
        {
          "heading": "Year: 2017",
          "content": [
            "Question Paper Code: 2611",
            "Questions:",
            "1. Write short notes on the following: (Compulsory, 4x10 marks)",
            "    (i) Quit India Movement",
            "    (ii) Indian National Congress",
            "    (iii) NonCooperation Movement",
            "    (iv) Federal Government",
            "    (v) Preamble of the Constitution",
            "    (vi) Republic Nation",
            "    (vii) Position of President in India",
            "    (viii) Council of Ministers",
            "    (ix) Right to Equality",
            "    (x) Features of the Indian Constitution",
            "2. Point out the difference of ideology of the moderates and extremists in the Indian Nationalism Movement. (15 marks)",
            "3. Critically examine the importance of Civil Disobedience movement and Quit India Movement in Indian National Movement. (15 marks)",
            "4. Write a note on the making of the Indian Constitution. (15 marks)",
            "5. Explain the relationship between Fundamental Rights and Directive Principles of State policy. (15 marks)",
            "6. In accordance to the provisions of the Indian Constitution explain the powers of the President. (15 marks)",
            "7. Explain the Jurisdiction of the Supreme Court. (15 marks)",
            "8. Write short notes on the following: (15 marks)",
            "    (i) Election Commission",
            "    (ii) Planning Commission",
            "9. Explain the following: (15 marks)",
            "    (i) Local Self Government",
            "    (ii) National Commission on Women"
          ]
        }
      ]
    }
  }


{
    "PoliticalScienceI-2016-2017": {
      "subject": "Semester 1",
      "title": "Political Science I",
      "units": [
        {
          "heading": "Year: 2016",
          "content": [
            "Question Paper Code: 2804",
            "Questions:",
            "1. Write short notes on the following: (Compulsory, 4x10 marks)",
            "    (i) Political Science as an Art",
            "    (ii) Meaning of Behaviouralism",
            "    (iii) Difference between the state and government",
            "    (iv) Matriarchal theory",
            "    (v) John Locke Human Nature",
            "    (vi) Federal form of government",
            "    (vii) Direct Democracy",
            "    (viii) Any two functions of the executive",
            "    (ix) Religion As a Source of Law",
            "    (x) Economic Equality",
            "2. Define political science with its various 'terms' used for it and also tell about its utility in modern times. (15 marks)",
            "3. Explain different traditional methods of study of political science. (15 marks)",
            "4. Write an essay on 'Divine theory' of the origin of the state. (15 marks)",
            "5. Discuss in detail 'Individualistic theory' of state action. (15 marks)",
            "6. What is 'Democracy'? Write its merits in your own words. (15 marks)",
            "7. What is Judicial supremacy? What are the functions of 'Judiciary' in a democratic state? (15 marks)",
            "8. Describe the meaning and definition of 'sovereignty' and also tell about its characteristics. (15 marks)",
            "9. Define 'Liberty' and also write about its kinds. How far does 'Law' restrain liberty? Explain your viewpoint. (15 marks)"
          ]
        },
        {
          "heading": "Year: 2017 (Paper 1)",
          "content": [
            "Question Paper Code: 2570",
            "Questions:",
            "1. Write short notes on the following: (Compulsory, 4x10=40 marks)",
            "    (a) Meaning of 'Political Theory'",
            "    (b) Patriarchal Theory",
            "    (c) Distinction between state and society",
            "    (d) Meaning of Force Theory",
            "    (e) Observational method of study",
            "    (f) Unitary Government",
            "    (g) Main function of Judiciary",
            "    (h) Customs as source of law",
            "    (i) Importance of 'Pressure Groups'",
            "    (j) Social Equality",
            "2. What do you understand by Political Science? Describe its scope in the present age. (15 marks)",
            "3. Write about meaning of 'Behaviourism'. Discuss its characteristics in your own words. (15 marks)",
            "4. Write an essay on 'Evolutionary theory' of the origin of state. (15 marks)",
            "5. Define 'Welfare State'. What are its functions? (15 marks)"
          ]
        }
      ]
    }
  }
}